docs/2016/GitBucket-SourceTree-WinMerge.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<!-- 2025-01-19 日 16:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Windows で GitBucket で Git サーバーを立て、SourceTree + WinMerge で利用する方法</title>
<meta name="author" content="clothoid" />
<meta name="keywords" content="git" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://clothoid.github.io/sitemap.html"> UP </a>
 |
 <a accesskey="H" href="https://clothoid.github.io/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Windows で GitBucket で Git サーバーを立て、SourceTree + WinMerge で利用する方法</h1>
<div id="table-of-contents" role="doc-toc">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org71ae660">1. 環境</a></li>
<li><a href="#orgc197244">2. Git サーバーの構築</a>
<ul>
<li><a href="#org669345c">2.1. Java 8 のダンロード</a></li>
<li><a href="#orgcf567cf">2.2. Tomcat 7 のインストール</a></li>
<li><a href="#orga8395ec">2.3. GitBucket のインストールと起動</a></li>
</ul>
</li>
<li><a href="#orge725f20">3. Git クライアントのインストール</a></li>
<li><a href="#org00294a2">4. SourceTree のインストール</a></li>
<li><a href="#org06bd74a">5. WinMerge のインストールと xdocdiff プラグインの設定</a>
<ul>
<li><a href="#org842645a">5.1. WinMerge 日本語版</a></li>
<li><a href="#orgab93fc5">5.2. xdocdiff</a></li>
</ul>
</li>
<li><a href="#org1922b1e">6. SourceTree で WinMerge を設定</a></li>
<li><a href="#org6790f85">7. 動作確認</a>
<ul>
<li><a href="#org608cf18">7.1. GitBucket で sample リポジトリの作成</a></li>
<li><a href="#org7cd358b">7.2. SourceTree から接続</a>
<ul>
<li><a href="#org8c59927">7.2.1. クローン</a></li>
<li><a href="#org5e7270f">7.2.2. コミット</a></li>
<li><a href="#orge9c7490">7.2.3. プッシュ</a></li>
</ul>
</li>
<li><a href="#orgc31ba99">7.3. GitBucket で 確認</a></li>
</ul>
</li>
<li><a href="#org4e4887d">8. 参考</a></li>
</ul>
</div>
</div>

<div id="outline-container-org71ae660" class="outline-2">
<h2 id="org71ae660"><span class="section-number-2">1.</span> 環境</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>サーバー
<ul class="org-ul">
<li>Windows 2012 R2</li>
<li>Java 8.0.91-b15</li>
<li>Tomcat 7.0</li>
<li>GitBucket 4.1.0</li>
</ul></li>
<li>クライアント
<ul class="org-ul">
<li>Windows 7</li>
<li>Git 2.9.0.windows.1</li>
<li>SourceTree 1.8.3.0</li>
<li>WinMerge 2.14.0.0 - Japanese Unicode
<ul class="org-ul">
<li>xdocdiff WinMerge Plugin 1.0.6d</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgc197244" class="outline-2">
<h2 id="orgc197244"><span class="section-number-2">2.</span> Git サーバーの構築</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org669345c" class="outline-3">
<h3 id="org669345c"><span class="section-number-3">2.1.</span> Java 8 のダンロード</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li><a href="https://java.com/ja/download/manual.jsp">https://java.com/ja/download/manual.jsp</a> にアクセス</li>
<li>[Windows オフライン (64 ビット)]をダンロード</li>
<li>画面にしたがいインストール</li>
</ol>
</div>
</div>
<div id="outline-container-orgcf567cf" class="outline-3">
<h3 id="orgcf567cf"><span class="section-number-3">2.2.</span> Tomcat 7 のインストール</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li><a href="http://tomcat.apache.org/download-70.cgi">http://tomcat.apache.org/download-70.cgi</a> にアクセス</li>
<li>画面にしたがいインストール (ここでは F:/Program Files にインストール)</li>
<li><p>
conf/server.xml を、下記の通り変更 (検索キーワード文字化け防止)
</p>
<div class="org-src-container">
<pre class="src src-sh">*** "/f/Program Files/Apache Software Foundation/Tomcat 7.0/conf/server.xml.orig"	2016-06-28 15:05:32.34805../0000 +0900
--- "/f/Program Files/Apache Software Foundation/Tomcat 7.0/conf/server.xml"	2016-06-28 15:06:25.659592300 +0900
***************
*** 70,76 ****
      --&gt;
      &lt;Connector port="50001" protocol="HTTP/1.1"
                 connectionTimeout="2../0000"
!                redirectPort="8443" /&gt;
      &lt;!-- A "Connector" using the shared thread pool--&gt;
      &lt;!--
      &lt;Connector executor="tomcatThreadPool"
--- 70,78 ----
      --&gt;
      &lt;Connector port="50001" protocol="HTTP/1.1"
                 connectionTimeout="2../0000"
!                redirectPort="8443"
!                URIEncoding="UTF-8"
!                useBodyEncodingForURI="true" /&gt;
      &lt;!-- A "Connector" using the shared thread pool--&gt;
      &lt;!--
      &lt;Connector executor="tomcatThreadPool"
</pre>
</div></li>
</ol>
</div>
</div>
<div id="outline-container-orga8395ec" class="outline-3">
<h3 id="orga8395ec"><span class="section-number-3">2.3.</span> GitBucket のインストールと起動</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li><a href="https://github.com/takezoe/gitbucket/releases">https://github.com/takezoe/gitbucket/releases</a> から gitbucket.war をダウンロード</li>
<li>システム環境変数に GITBUCKET _ HOME を設定（例：F:/GitBucket）</li>
<li>F:/Program Files/Apache Software Foundation/Tomcat 7.0/webapps に war ファイルを配置</li>
<li>F:/Program Files/Apache Software Foundation/Tomcat 7.0/bin/Tomcat7w.exe を起動</li>
<li>[Start] で実行</li>
<li><a href="http://hostname:8080/gitbucket">http://hostname:8080/gitbucket</a> へ接続</li>
<li>root/root でログイン確認</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-orge725f20" class="outline-2">
<h2 id="orge725f20"><span class="section-number-2">3.</span> Git クライアントのインストール</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><a href="https://git-for-windows.github.io/">https://git-for-windows.github.io/</a> にアクセス</li>
<li>[Download]よりダウンロード</li>
<li>画面に従いインストール</li>
</ol>
</div>
</div>

<div id="outline-container-org00294a2" class="outline-2">
<h2 id="org00294a2"><span class="section-number-2">4.</span> SourceTree のインストール</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><a href="https://www.sourcetreeapp.com/">https://www.sourcetreeapp.com/</a> にアクセス</li>
<li>[Download Source Tree]よりダウンロード</li>
<li>画面に従いインストール
<ul class="org-ul">
<li>My Atlassian アカウントは作成しなければならなっぽい</li>
<li>[Connect an Account] はスキップで OK</li>
<li>[SSH キーを読み込みますか？]は No で OK</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org06bd74a" class="outline-2">
<h2 id="org06bd74a"><span class="section-number-2">5.</span> WinMerge のインストールと xdocdiff プラグインの設定</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org842645a" class="outline-3">
<h3 id="org842645a"><span class="section-number-3">5.1.</span> WinMerge 日本語版</h3>
<div class="outline-text-3" id="text-5-1">
<ol class="org-ol">
<li><a href="http://www.geocities.co.jp/SiliconValley-SanJose/8165/winmerge.html">http://www.geocities.co.jp/SiliconValley-SanJose/8165/winmerge.html</a> にアクセス</li>
<li>WinMerge 日本語版 <b>32bit 版</b> をダウンロード (xdocdiff が 32bit でないと動かないため)</li>
<li>画面に従いインストール</li>
</ol>
</div>
</div>
<div id="outline-container-orgab93fc5" class="outline-3">
<h3 id="orgab93fc5"><span class="section-number-3">5.2.</span> xdocdiff</h3>
<div class="outline-text-3" id="text-5-2">
<ol class="org-ol">
<li><a href="http://freemind.s57.xrea.com/xdocdiffPlugin/">http://freemind.s57.xrea.com/xdocdiffPlugin/</a> にアクセス</li>
<li>xdocdiffPlugin_1_0_6d.zip をダウンロード</li>
<li>xdoc2txt.exe、zlib.dll を WinMerge のインストールフォルダ（WinMerge.exe と同じフォルダ）にコピー</li>
<li>amb_xdocdiffPlugin.dll をインストールフォルダのサブフォルダ"MergePlugins"にコピー</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org1922b1e" class="outline-2">
<h2 id="org1922b1e"><span class="section-number-2">6.</span> SourceTree で WinMerge を設定</h2>
<div class="outline-text-2" id="text-6">
<ol class="org-ol">
<li>WinMerge を起動
<ol class="org-ol">
<li>[プラグイン]&gt;[リスト]</li>
<li>[プラグインを有効にする]にチェック</li>
<li>[OK]</li>
<li>[プラグイン]&gt;[自動展開]にチェック</li>
</ol></li>
<li>SourceTree を起動
<ol class="org-ol">
<li>[ツール]&gt;[オプション]</li>
<li>[Diff]タブ</li>
<li>[外部 Diff ツール]を[WinMerge]に設定</li>
<li>[OK]</li>
<li>WinMergeU.exe を選択</li>
</ol></li>
</ol>
</div>
</div>
<div id="outline-container-org6790f85" class="outline-2">
<h2 id="org6790f85"><span class="section-number-2">7.</span> 動作確認</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org608cf18" class="outline-3">
<h3 id="org608cf18"><span class="section-number-3">7.1.</span> GitBucket で sample リポジトリの作成</h3>
<div class="outline-text-3" id="text-7-1">
<ol class="org-ol">
<li><a href="http://hostname:8080/gitbucket">http://hostname:8080/gitbucket</a> へ接続</li>
<li>root/root でログイン</li>
<li>[+]&gt;[New repository]</li>
<li>[Repository name] を [sample] に</li>
<li>[Create repository] を選択</li>
</ol>
</div>
</div>
<div id="outline-container-org7cd358b" class="outline-3">
<h3 id="org7cd358b"><span class="section-number-3">7.2.</span> SourceTree から接続</h3>
<div class="outline-text-3" id="text-7-2">
</div>
<div id="outline-container-org8c59927" class="outline-4">
<h4 id="org8c59927"><span class="section-number-4">7.2.1.</span> クローン</h4>
<div class="outline-text-4" id="text-7-2-1">
<ol class="org-ol">
<li>[新規/クローンを作成する]を選択</li>
<li>[リポジトリをクローン]タブの[元のパス/URL]に [<a href="http://hostname:8080/gitbucket/git/root/sample.git">http://hostname:8080/gitbucket/git/root/sample.git</a>] を入力</li>
<li>[保存先のパス]に適当なものを入力</li>
<li>[クローン]を選択</li>
</ol>
</div>
</div>
<div id="outline-container-org5e7270f" class="outline-4">
<h4 id="org5e7270f"><span class="section-number-4">7.2.2.</span> コミット</h4>
<div class="outline-text-4" id="text-7-2-2">
<ol class="org-ol">
<li>[保存先のパス] で指定したフォルダに適当なエクセルファイルを追加</li>
<li>SourceTree の[作業ツリーのファイル]で作成したファイルにチェックを入れる</li>
<li>コミットメッセージ欄に適当にメッセージを入力</li>
<li>[コミット]を選択</li>
<li>エクセルファイルを編集</li>
<li>[操作]&gt;[外部 Diff]で確認</li>
</ol>
</div>
</div>
<div id="outline-container-orge9c7490" class="outline-4">
<h4 id="orge9c7490"><span class="section-number-4">7.2.3.</span> プッシュ</h4>
<div class="outline-text-4" id="text-7-2-3">
<ol class="org-ol">
<li>[プッシュ]を選択</li>
<li>[プッシュ先]を確認</li>
<li>[対象]にチェック</li>
<li>[OK]</li>
<li>[Authenticate]で、root/root を入力</li>
<li>[Login]</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgc31ba99" class="outline-3">
<h3 id="orgc31ba99"><span class="section-number-3">7.3.</span> GitBucket で 確認</h3>
<div class="outline-text-3" id="text-7-3">
<ol class="org-ol">
<li><a href="http://hostname:8080/gitbucket">http://hostname:8080/gitbucket</a> へ接続</li>
<li>root/root でログイン</li>
<li>Your repositories で [sample] を選択</li>
<li>内容を確認</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org4e4887d" class="outline-2">
<h2 id="org4e4887d"><span class="section-number-2">8.</span> 参考</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li><a href="https://github.com/gitbucket/gitbucket">GitHub - gitbucket/gitbucket: A Git platform powered by Scala with easy installation, high extensibility &amp; github API compatibility</a></li>
<li><a href="http://qiita.com/yuann/items/5759a11a49dd0580d80b">Windows 環境で GitBucket - Qiita</a></li>
<li><a href="http://celtislab.net/archives/20140520/git-step1/">Git 入門（GitBucket と SourceTree の準備） – セルティスラボ</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#33879;&#32773;: clothoid</p>
<p class="date">Created: 2025-01-19 日 16:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
